[{"id":"1","user":"admin","time":"","group":"nodeisrael","email":"0777816627a@gmail.com","text":["Appwrite"],"notifiedPosts":["היי חברים!! שמח לעדכן ששחרנו את גרסה 0.8 של Appwrite שמקרבת אותנו עוד צעד קטן בדרך להיות אלטרנטיבה מלאה לפיירבייס בקוד פתוח! בגרסה החדשה הוספנו תמיכה ל-JWT, ARM, משתמשים אנונימים יכולות חיתוך תמונות חדשות (קצת כמו Cloudinary) ועוד מלא דברים דיי מגניבים.ממש נשמח לקבל פידבקים על הגרסה החדשה ופיצ׳רים נוספים שהייתם רוצים לראות.  בחודשים הקרובים נמשיך לעבוד על הוספה של יכולות Realtime, שדרוג ה-DB (הוספת תמיכה למונגו), API ל-GraphQL ועוד מלא דברים - מוזמנים גם להצטרף לקהילה הגדלה… עוד","היי חברים! ממש ממש (ממש) שמח לעדכן שסוף סוף הוצאנו השבוע את הגרסה החדשה של Appwrite, גרסה 0.7 עם מלא מלא חידושים. אנחנו בונים אלטרנטיבה בקוד פתוח ל-Firebase שנמצאת כרגע בשלבי בטא ואנחנו כבר ממש מתקדמים לעבר גרסה 1.0.בגרסה החדשה הוספנו מעל 100 פיצרים ועדכונים כולל מערכת של Cloud Functions , תמיכה ב-Brotli compression , כלי CLI חדש לעבודה ישירות מהטרמינל, תמיכה בפלאטר ווב , שיפורי ביצועים דרמטיים ועוד באמת מלא דברים מעניינים. מי שלא מכיר עדיין מוזמן ללמוד עוד באתר של הפר… עוד","אחרי שישה שבועות של אינסוף עבודה, שיחות דיסקורד לתוך הלילה עם אנשים מעשרה אזורי זמן שונים ו-250+ commits סוף סוף גרסה 0.6 של Appwrite יצאה לאוויר העולם עם תמיכה ב-TypeScript, אינטגרציה לאפילקציות Flutter, ממשק חדש ועוד המון פיצ׳רים.  מוזמנים ללמוד מה חדש וגם מה צפוי לגרסאות הבאות:https://medium.com/.../introducing-appwrite-0-6-with...למי שעדיין לא מכיר, Appwrite הוא שרת backend-as-a-service בקוד פתוח. השרת מגיע עם המון SDK-ים, כלים ו-API-ים… עוד","היי חברים! בדיוק אתמול שחררנו את גרסה 0.5 של Appwrite עם המון עדכונים. מי שלא מכיר Appwrite הוא פרוייקט בקוד פתוח שהתחלתי לפני כמה חודשים ומאז ממש תפס תאוצה בקהילה. הוא דורג כבר 7 פעמים כפרוייקט הכי טרנדי בגיטהאב, יש לו נכון להיום כבר למעלה מ-2,200 כוכבים ומעל 100 תורמים!המוצר הוא בעצם שרת Backend שעטוף כסט של Docker Containers שממש קל להרים בכל סביבה שבא לכם, השרת עצמו מציעה סט של API-ים וכלים שמאוד עוזרים להאיץ תהליכי פיתוח של אפלקיציות ווב או מובייל ומעבר לזה גם מציע המו… עוד"],"lastCheck":["ברוכים הבאים ל nodejs Israel! הקבוצה מגיעה כדי לאפשר לכם לרכוש ידע ולעקוב אחר ההתפתחויות עם כמה שפחות רעש מיותר.פה תקבלו את העדכונים החשובים בזמן, תוכלו להצטרף לדיונים בנושאים המעניינים אתכם ולשמוע דעות של אנשים מנוסים.  אתם לא חייבים להגיע עם ניסיון, הקמנו את הקבוצה כדי שיהיה מקום עבור כולם לדבר ללמוד ולהתייעץ על כל דבר שקשור לנודג׳ס… עוד","היי, איך אתם עושים דיפלוי כשמדובר ב nodejs on vps server. אני מריץ את הפקודה הבאה מטרמינל שמעבירה את הקבצים לשרת, עדיין אין לי רעיון איך לאתחל את הסרבר בשרת ממחשב הפיתוח (אובונטו)rsync -aP ./ --exclude 'node_modules' --exclude '.git' --exclude '.idea' --exclude '.env' [myserversshlogin]","היי חברים!! שמח לעדכן ששחרנו את גרסה 0.8 של Appwrite שמקרבת אותנו עוד צעד קטן בדרך להיות אלטרנטיבה מלאה לפיירבייס בקוד פתוח! בגרסה החדשה הוספנו תמיכה ל-JWT, ARM, משתמשים אנונימים יכולות חיתוך תמונות חדשות (קצת כמו Cloudinary) ועוד מלא דברים דיי מגניבים.ממש נשמח לקבל פידבקים על הגרסה החדשה ופיצ׳רים נוספים שהייתם רוצים לראות.  בחודשים הקרובים נמשיך לעבוד על הוספה של יכולות Realtime, שדרוג ה-DB (הוספת תמיכה למונגו), API ל-GraphQL ועוד מלא דברים - מוזמנים גם להצטרף לקהילה הגדלה… עוד","אולי לא בדיוק קשור לקבוצה, אבל קשור בעקיפין.יש לי שרת אקספרס שרץ על שרת לינוקס (ec2).אני משתמש בספריה שנקראת גטסטרים, שבין היתר מוציאה קריאות http מהשרת לדומיין של גטסטרים.הבעיה היא שהפיירוול חוסם את הקריאות האלו.היות ואני לא יכול להיכנס לקוד של הספריה ולשנות את הקריאות שלה, אני מחפש דרך שבה אני יכול להעביר את כל הקריאות שיוצאות מהמכונה דרך שרת פרוקסי שהגדרתי והוא כבר יעביר את הקריאות לדומיין הרצוי.… עוד","היי חברים! ממש ממש (ממש) שמח לעדכן שסוף סוף הוצאנו השבוע את הגרסה החדשה של Appwrite, גרסה 0.7 עם מלא מלא חידושים. אנחנו בונים אלטרנטיבה בקוד פתוח ל-Firebase שנמצאת כרגע בשלבי בטא ואנחנו כבר ממש מתקדמים לעבר גרסה 1.0.בגרסה החדשה הוספנו מעל 100 פיצרים ועדכונים כולל מערכת של Cloud Functions , תמיכה ב-Brotli compression , כלי CLI חדש לעבודה ישירות מהטרמינל, תמיכה בפלאטר ווב , שיפורי ביצועים דרמטיים ועוד באמת מלא דברים מעניינים. מי שלא מכיר עדיין מוזמן ללמוד עוד באתר של הפר… עוד","שינינו מועד!Backend talks - session no. 2!!!הצטרפו ל-XM CYBER ואל Yaron Shani ו- Sophia Morozov לוובינר מרתק על Big Data, Stream Processing & Flink – Challenges, Issues & Lessons Learnedהרשמה בלינק: https://docs.google.com/.../1RgnpLXOfW9D71wCD.../viewform...#aws #flink #bigdata #scala #flinkmigration #scaleup #monolith #bigdata #cyber #cybersecurity #cloud #cloudsecurity #AWS #pentest #redteam #blueteam #purpleteam … עוד"]},{"id":"2","user":"admin","time":"","group":"secretjerusalem","email":"0777816627a@gmail.com","text":["למסירה","מוסרים","מוסר","בחינם"],"notifiedPosts":[],"lastCheck":["#Titehadech le vehicule que tout le monde recherche, que tout le monde s’arrache sur le marché du neuf en israel, est disponible chez Car Adviser (Plus que 1 seul en stock) !On commence la semaine très fort ! Un grand merci à Benjamin pour sa confiance da… עוד","Hi Everyone!I created a new, three year, Jewish holidaycalendar card which I posted on my websitefor you to view, download or print.… עוד","Jo's BBQ PRIVATE BBQ CHIEFNew : WINE IS INCLUDED IN OUR MENUSTASTING MENUFirst + 7 kinds of meat ( 500gr )+ Dessert for 200 nis per person… עוד","Hi!  In a nutshell, I moved away from Israel in 2019 and I thought all the proper paperwork was filled out but it wasn't.  I need to let Bituach Leumi (I think) know that I am and have been residing in the US since 2019.  I was given a link t fill out on the Bituach Leumi site but it's only in Hebrew and I thought someone mentioned to me that it needed to be filled out in person but am uncertain.  Does anyone know how I should proceed?  I just to stop paying Bituach Leumi and… עוד"]},{"id":"3","user":"admin","time":"","group":"secretjerusalem","email":"0777816627a@gmail.com","text":["למסירה","מוסרים","מוסר","בחינם"],"notifiedPosts":[],"lastCheck":["#Titehadech le vehicule que tout le monde recherche, que tout le monde s’arrache sur le marché du neuf en israel, est disponible chez Car Adviser (Plus que 1 seul en stock) !On commence la semaine très fort ! Un grand merci à Benjamin pour sa confiance da… עוד","Hi Everyone!I created a new, three year, Jewish holidaycalendar card which I posted on my websitefor you to view, download or print.… עוד"]}]